formApp/app/controllers/land_regularizations_controller.rb

INSERT INTO "land_regularizations" ("state", "city", "polygonal_area", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["state", "State C"], ["city", "City B"], ["polygonal_area", nil], ["created_at", "2023-04-14 18:55:48.192560"], ["updated_at", "2023-04-14 18:55:48.192560"]]
---
  def create
    @land_regularization = LandRegularization.new(land_regularization_params)
    if @land_regularization.save